---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Events.DocumentPrintedEventArgs
source: html/82c15c3e-d8f0-4c36-8898-9ffe03ed49e5.htm
---
# DocumentPrintedEventArgs Members

Returns ElementIds of the views that that failed to print (if any).